app/views/species/index.html.erb

		<td><%= species.shape %></td>
		<td><%= species.habitats.first.identifier %></td>
---
SELECT  "habitats".* FROM "habitats" INNER JOIN "species_habitats_relationships" ON "habitats"."id" = "species_habitats_relationships"."habitat_id" WHERE "species_habitats_relationships"."species_id" = $1 ORDER BY "habitats"."id" ASC LIMIT $2  [["species_id", 357], ["LIMIT", 1]]