app/controllers/my_pokemons_controller.rb

SELECT "my_pokemons".* FROM "my_pokemons"
UPDATE "my_pokemons" SET "exp" = $1, "level" = $2, "ready_for_evolution" = $3, "updated_at" = $4 WHERE "my_pokemons"."id" = $5  [["exp", 62], ["level", 14], ["ready_for_evolution", "t"], ["updated_at", "2018-02-03 13:25:44.932985"], ["id", 5]]
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."growth_rate" = $1 AND "experiences"."level" = $2 LIMIT $3  [["growth_rate", "slow"], ["level", 31], ["LIMIT", 1]]
SELECT  "species".* FROM "species" WHERE "species"."evolves_from_species_id" = $1 LIMIT $2  [["evolves_from_species_id", 25], ["LIMIT", 1]]
---
	def index
		@pokemons = MyPokemon.all

		@pokemons.each{|pokemon|

			exp_standard = Experience.where(growth_rate:pokemon.growth_rate)

			#check each pokmon's time difference between current time and update time
			time_difference = Time.now.utc - pokemon.updated_at

			#add exp base on time pass
			pokemon.exp = pokemon.exp + time_difference*10000 #1 min get 1 exp

			#if exp > upgrate request exp, upgrate to next level
			while pokemon.level < 100 && pokemon.exp > exp_standard.find_by(level:pokemon.level).experience.to_i
				pokemon.exp = pokemon.exp - exp_standard.find_by(level:pokemon.level).experience.to_i
				pokemon.level += 1
				pokemon.ready_for_evolution = false

				# if pokemon can evolute, ture the ready_for_evolution on
				evolute_species = Species.find_by(evolves_from_species_id: pokemon.species_id)

SELECT  "my_pokemons".* FROM "my_pokemons" WHERE "my_pokemons"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
			end

			# update exp, level & update_at to current time
			updatePokemon = MyPokemon.find_by(id:pokemon.id)

SELECT  "species".* FROM "species" WHERE "species"."identifier" = $1 LIMIT $2  [["identifier", "pikachu"], ["LIMIT", 1]]
INSERT INTO "my_pokemons" ("species_id", "nickname", "level", "exp", "growth_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["species_id", 25], ["nickname", "pikapi"], ["level", 30], ["exp", 0], ["growth_rate", "medium"], ["created_at", "2018-02-03 11:07:14.145963"], ["updated_at", "2018-02-03 11:07:14.145963"]]
---
	def create
		identifier = params[:identifier].chomp.to_s
		pokemon = Species.find_by(identifier:identifier)

		# render :json => @pokemon
		if pokemon
			new_pokemon = MyPokemon.new
			new_pokemon.species_id = pokemon.id
			new_pokemon.nickname = params[:nickname]
			new_pokemon.level = params[:level]
			new_pokemon.exp = 0
			new_pokemon.growth_rate = pokemon.growth_rate
			new_pokemon.save

SELECT  "my_pokemons".* FROM "my_pokemons" WHERE "my_pokemons"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "species".* FROM "species" WHERE "species"."evolves_from_species_id" = $1 LIMIT $2  [["evolves_from_species_id", 7], ["LIMIT", 1]]
UPDATE "my_pokemons" SET "species_id" = $1, "ready_for_evolution" = $2, "updated_at" = $3 WHERE "my_pokemons"."id" = $4  [["species_id", 26], ["ready_for_evolution", "f"], ["updated_at", "2018-02-04 07:09:13.493506"], ["id", 11]]
SELECT  "species".* FROM "species" WHERE "species"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
	def update
		@pokemon = MyPokemon.find_by(id:params[:id])
		evolutePokemon = Species.find_by(evolves_from_species_id: @pokemon.species_id)
		@pokemon.species_id = evolutePokemon.id
		@pokemon.ready_for_evolution = false

		# if pokemon can evolute, ture the ready_for_evolution on
		evolute_species = Species.find_by(evolves_from_species_id: @pokemon.species_id)
		if evolute_species != nil
			if evolute_species.evolution_min_level == nil || @pokemon.level > evolute_species.evolution_min_level
				@pokemon.ready_for_evolution = true
			end
		end

		@pokemon.save

		# @pokemon.species_name = Species.find_by(id:@pokemon.species_id).identifier
		newSpecies = Species.find_by(id:@pokemon.species_id)