app/controllers/species_controller.rb

SELECT "species".* FROM "species"
---
	def index
		@species = Species.all

SELECT  "species".* FROM "species" WHERE "species"."identifier" = $1 LIMIT $2  [["identifier", "ivysaur"], ["LIMIT", 1]]
---
	def show
		@specie = Species.find_by(identifier:params[:identifier])